---

C#Visual BasicVisual C++

Revit 2024 API
---
TopographySurface..::..IsValidFaceSet Method
TopographySurface Class See Also Send Feedback
---

Identifies whether the facets can construct a valid topography surface.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019.2

# Syntax

C#
---

    public static bool IsValidFaceSet(
    	IList<PolymeshFacet> facets,
    	IList<XYZ> points
    )

Visual Basic
---

    Public Shared Function IsValidFaceSet ( _
    	facets As IList(Of PolymeshFacet), _
    	points As IList(Of XYZ) _
    ) As Boolean

Visual C++
---

    public:
    static bool IsValidFaceSet(
    	IList<PolymeshFacet^>^ facets,
    	IList<XYZ^>^ points
    )

#### Parameters

facets
    Type: System.Collections.Generic..::..IList<(Of <(<'PolymeshFacet>)>)> The facets to be checked.

points
    Type: System.Collections.Generic..::..IList<(Of <(<'XYZ>)>)> A collection of points.

#### Return Value

True if the facets are valid, otherwise false.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | There are no points in the input points set. -or- There were not enough points to form a valid region (at least 3 are required), or the points were collinear ignoring elevation. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also

TopographySurface Class

Autodesk.Revit.DB.Architecture Namespace